# Homebrew Bundle file for Mac Setup
# Install with: brew bundle

# Taps
tap "homebrew/cask-fonts"

# Essential CLI tools
brew "git"
brew "gh"
brew "curl"
brew "wget"
brew "tmux"
brew "tree"
brew "htop"
brew "fzf"
brew "ripgrep"
brew "fd"
brew "bat"
brew "jq"
brew "yq"
brew "httpie"
brew "coreutils"
brew "gnu-sed"
brew "exa" # deprecated, consider using eza
brew "eza"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "zsh-fast-syntax-highlighting"
brew "starship"

# Development tools
brew "node"
brew "python@3.11"
brew "pyenv"
brew "pipx"
brew "uv"
brew "go"
brew "rust"
brew "docker"
brew "docker-compose"

# Applications
cask "visual-studio-code"
cask "iterm2"
cask "sublime-text"
cask "cleanshot"
cask "notion"
cask "raycast"
cask "bitwarden"
cask "google-chrome"
cask "firefox"
cask "slack"
cask "discord"
cask "figma"
cask "imageoptim"
cask "maccy"
cask "zoom"
cask "ngrok"
cask "obs"
cask "keycastr"
cask "shotcut"
cask "docker"
cask "podman-desktop"
# cask "1password"
# cask "rectangle"
# cask "alfred"

# Fonts
cask "font-hack-nerd-font"
cask "font-meslo-lg-nerd-font"

# Mac App Store apps (requires mas-cli)
brew "mas"
# mas "Xcode", id: 497799835
# mas "Numbers", id: 409203825
# mas "Pages", id: 409201541
